Revit 2026 API

# FailureMessageSetFailingElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureMessage SetFailingElements(
	ICollection<ElementId> idsToShow
)
```
```vb
Public Function SetFailingElements (
	idsToShow As ICollection(Of ElementId)
) As FailureMessage
```
```cpp
public:
FailureMessage^ SetFailingElements(
	ICollection<ElementId^>^ idsToShow
)
```
```fsharp
member SetFailingElements :
        idsToShow : ICollection<ElementId> -> FailureMessage
```

#### Parameters

idsToShow ICollectionElementId

#### Return Value

FailureMessage

#### Reference

FailureMessage Class

Autodesk.Revit.DB Namespace